AXKuhta/stm32_ad9910/uart_cli.c
	memset(ram + element_count*4, 0, 4);

	uint32_t lower_ftw = ftw;
	uint32_t upper_ftw = ftw + a * (steps - 1);

	// We can only reset DRG to lower_ftw, therefore lower_ftw must always be lower than upper_ftw
	// Use mirrored FTWs for f1 > f2 sweeps
	if (a < 0) {
		lower_ftw = (1ull << 32) - lower_ftw;
		upper_ftw = (1ull << 32) - upper_ftw;
	}

	seq_entry_t pulse = {
		.sweep = {
			.fstep_ftw = ABS(a),
			.tstep = b,
			.lower_ftw = lower_ftw,
			.upper_ftw = upper_ftw
		},
		.t1 = timer_mu(offset_ns),
		.t2 = timer_mu(offset_ns + duration_ns),
		.fsc = ad_default_fsc,
		.ram_profiles[0] = {
			.start = element_count,
			.end = element_count,
			.rate = 0,
			.mode = AD_RAM_PROFILE_MODE_DIRECTSWITCH
		},
		.ram_profiles[1] = {
			.start = 0,
			.end = element_count,
			.rate = rate,
			.mode = AD_RAM_PROFILE_MODE_RAMPUP
		},
		.ram_image = { .buffer = (uint32_t*)ram, .size = element_count + 1 },
		.ram_destination = AD_RAM_DESTINATION_POLAR,
		.logic_level_sequence = lower_logic_sequence((logic_t[]){
			{ .hold = emit_sec, .state = PROFILE1 },
			{ .hold = .000001, .state = PROFILE0 },
			{ 0, 0 }
		})
	};

	if (run) {
		sequencer_reset();
		sequencer_add(pulse);
		sequencer_run();
	} else {
		sequencer_add(pulse);
	}
}

void sequencer_add_sweep_cmd(const char* str) {
	sequencer_add_sweep_internal(str, "%*s %*s %lf %3s %lf %3s %lf %3s %d %d", "seq sweep", 0);
}

void basic_sweep_cmd(const char* str) {
	sequencer_add_sweep_internal(str, "%*s %lf %3s %lf %3s %lf %3s %d %d", "basic_sweep", 1);
}

// The compiler can't tell that two different vec_t(uint8_t)* are actually the same type
// Declare this function as void pointer to silence type warning
void* scan_uint8_data(const char* str) {
	vec_t(uint8_t)* vec = init_vec(uint8_t);

	char* values = (char*)str;
	char* endptr;

	while (1) {
		unsigned int v = strtoul(values, &endptr, 0);

		if (endptr == values) {
			break;
		} else {
			vec_push(vec, v);
			values = endptr;
		}
	}

	printf("Loaded %u values\n", vec->size);

	return vec;
}

void xmitdata_fsk_cmd(const char* str) {
	char o_unit[4] = {0};
	char f1_unit[4] = {0};
	char f2_unit[4] = {0};
	char ts_unit[4] = {0};
	double offset;
	double f1;
	double f2;
	double tstep;
	int data_offset;

	int rc = sscanf(str, "%*s %*s %lf %3s %lf %3s %lf %3s %lf %3s %n", &offset, o_unit, &f1, f1_unit, &f2, f2_unit, &tstep, ts_unit, &data_offset);

	if (rc != 8) {
		printf("Invalid arguments: %d\n", rc);
		printf("Usage: basic_xmitdata fsk offset unit f1 unit f2 unit tstep unit data data data ...\n");
		printf("Example: basic_xmitdata fsk 0 us 151.10 MHz 151.11 MHz 10 us 1 1 0 1 ...\n");
		return;
	}

	uint32_t f1_hz = parse_freq(f1, f1_unit);
	uint32_t f2_hz = parse_freq(f2, f2_unit);
	uint32_t offset_ns = parse_time(offset, o_unit);
	uint32_t tstep_ns = parse_time(tstep, ts_unit);
	double step = tstep_ns / 1000.0 / 1000.0 / 1000.0;

	vec_t(uint8_t)* vec = scan_uint8_data(str + data_offset);
	vec_t(logic_t)* v2 = init_vec(logic_t);

	for (size_t i = 0; i < vec->size; i++) {
		vec_push(v2, (logic_t){
			.hold = step,
			.state = vec->elements[i] ? PROFILE2 : PROFILE3
		});
	}

	vec_push(v2, (logic_t){ .hold = .000001, .state = PROFILE0 } );
	vec_push(v2, (logic_t){ 0 });

	uint32_t duration_ns = tstep_ns * vec->size;
	
	if (f1_hz == 0 || f2_hz == 0) {
		return;
	}

	char* verif_f1 = freq_unit(f1_hz);
	char* verif_f2 = freq_unit(f2_hz);
	char* verif_offset = time_unit(offset_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_tstep = time_unit(tstep_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_duration_ns = time_unit(duration_ns / 1000.0 / 1000.0 / 1000.0);

	printf("Basic FSK at %s + %s, offset %s, %u * %s elements = %s total duration\n", verif_f1, verif_f2, verif_offset, vec->size, verif_tstep, verif_duration_ns);

	free(verif_f1);
	free(verif_f2);
	free(verif_offset);
	free(verif_tstep);
	free(verif_duration_ns);

	seq_entry_t pulse = {
		.t1 = timer_mu(offset_ns),
		.t2 = timer_mu(offset_ns + duration_ns),
		.fsc = ad_default_fsc,
		.profiles[0] = { .ftw = 0, .asf = 0 },
		.profiles[2] = { .ftw = ad_calc_ftw(f1_hz), .asf = ad_default_asf },
		.profiles[3] = { .ftw = ad_calc_ftw(f2_hz), .asf = ad_default_asf },
		.logic_level_sequence = lower_logic_sequence(v2->elements)
	};

	sequencer_reset();
	sequencer_add(pulse);
	sequencer_run();

	free_vec(vec);
	free_vec(v2);
}

void xmitdata_psk_cmd(const char* str) {
	char o_unit[4] = {0};
	char f_unit[4] = {0};
	char ts_unit[4] = {0};
	double offset;
	double freq;
	double tstep;
	int data_offset;

	int rc = sscanf(str, "%*s %*s %lf %3s %lf %3s %lf %3s %n", &offset, o_unit, &freq, f_unit, &tstep, ts_unit, &data_offset);

	if (rc != 6) {
		printf("Invalid arguments: %d\n", rc);
		printf("Usage: basic_xmitdata psk offset unit freq unit tstep unit data data data ...\n");
		printf("Example: basic_xmitdata psk 0 us 151.10 MHz 10 us 1 1 0 1 ...\n");
		return;
	}

	uint32_t freq_hz = parse_freq(freq, f_unit);
	uint32_t offset_ns = parse_time(offset, o_unit);
	uint32_t tstep_ns = parse_time(tstep, ts_unit);
	double step = tstep_ns / 1000.0 / 1000.0 / 1000.0;

	vec_t(uint8_t)* vec = scan_uint8_data(str + data_offset);
	vec_t(logic_t)* v2 = init_vec(logic_t);

	for (size_t i = 0; i < vec->size; i++) {
		vec_push(v2, (logic_t){
			.hold = step,
			.state = vec->elements[i] ? PROFILE2 : PROFILE3
		});
	}

	vec_push(v2, (logic_t){ .hold = .000001, .state = 0 } );
	vec_push(v2, (logic_t){ 0 });

	uint32_t duration_ns = tstep_ns * vec->size;
	
	if (freq_hz == 0) {
		return;
	}

	char* verif_freq = freq_unit(freq_hz);
	char* verif_offset = time_unit(offset_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_tstep = time_unit(tstep_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_duration = time_unit(duration_ns / 1000.0 / 1000.0 / 1000.0);

	printf("Basic PSK at %s, offset %s, %u * %s elements = %s total duration\n", verif_freq, verif_offset, vec->size, verif_tstep, verif_duration);

	free(verif_freq);
	free(verif_offset);
	free(verif_tstep);
	free(verif_duration);

	uint32_t ftw = ad_calc_ftw(freq_hz);

	seq_entry_t pulse = {
		.t1 = timer_mu(offset_ns),
		.t2 = timer_mu(offset_ns + duration_ns),
		.fsc = ad_default_fsc,
		.profiles[0] = { .ftw = 0, .asf = 0 },
		.profiles[2] = { .ftw = ftw, .pow = 0x0000, .asf = ad_default_asf },
		.profiles[3] = { .ftw = ftw, .pow = 0x7FFF, .asf = ad_default_asf },
		.logic_level_sequence = lower_logic_sequence(v2->elements)
	};

	sequencer_reset();
	sequencer_add(pulse);
	sequencer_run();

	free_vec(vec);
	free_vec(v2);
}

void xmitdata_zc_psk_cmd(const char* str) {
	char o_unit[4] = {0};
	char f_unit[4] = {0};
	char ts_unit[4] = {0};
	double offset;
	double freq;
	double tstep;
	int data_offset;

