AXKuhta/stm32_ad9910/uart_cli.c
	int rc = sscanf(str, "%*s %*s %lf %3s %lf %3s %lf %3s %n", &offset, o_unit, &freq, f_unit, &tstep, ts_unit, &data_offset);

	if (rc != 6) {
		printf("Invalid arguments: %d\n", rc);
		printf("Usage: basic_xmitdata zc_psk offset unit freq unit tstep unit data data data ...\n");
		printf("Example: basic_xmitdata zc_psk 0 us 151.10 MHz 10 us 1 1 0 1 ...\n");
		return;
	}

	uint32_t freq_hz = parse_freq(freq, f_unit);
	uint32_t offset_ns = parse_time(offset, o_unit);
	uint32_t tstep_ns = parse_time(tstep, ts_unit);
	double step = tstep_ns / 1000.0 / 1000.0 / 1000.0;

	vec_t(uint8_t)* vec = scan_uint8_data(str + data_offset);
	vec_t(logic_t)* v2 = init_vec(logic_t);

	for (size_t i = 0; i < vec->size; i++) {
		vec_push(v2, (logic_t){
			.hold = step,
			.state = vec->elements[i] ? PROFILE2 : PROFILE3
		});
	}

	vec_push(v2, (logic_t){ .hold = .000001, .state = 0 } );
	vec_push(v2, (logic_t){ 0 });

	uint32_t duration_ns = tstep_ns * vec->size;
	
	if (freq_hz == 0) {
		return;
	}

	char* verif_freq = freq_unit(freq_hz);
	char* verif_offset = time_unit(offset_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_tstep = time_unit(tstep_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_duration = time_unit(duration_ns / 1000.0 / 1000.0 / 1000.0);

	printf("Basic PSK at %s, offset %s, %u * %s elements = %s total duration\n", verif_freq, verif_offset, vec->size, verif_tstep, verif_duration);

	free(verif_freq);
	free(verif_offset);
	free(verif_tstep);
	free(verif_duration);

	uint32_t ftw = ad_calc_ftw(freq_hz) & 0xFFFC0000;

	uint8_t bpsk_ram_image[12] = {
		0x00, 0x00, 0x00, 0x00,
		0x00, 0x00, (ad_default_asf >> 6), (ad_default_asf << 2) & 0xFF,
		0x7F, 0xFF, (ad_default_asf >> 6), (ad_default_asf << 2) & 0xFF
	};

	uint8_t* ram = malloc(12);

	memcpy(ram, bpsk_ram_image, 12);

	seq_entry_t pulse = {
		.t1 = timer_mu(offset_ns),
		.t2 = timer_mu(offset_ns + duration_ns),
		.fsc = ad_default_fsc,
		.ram_profiles[0] = { .start = 0, .end = 0, .rate = 0, .mode = AD_RAM_PROFILE_MODE_ZEROCROSSING },
		.ram_profiles[2] = { .start = 1, .end = 1, .rate = 0, .mode = AD_RAM_PROFILE_MODE_ZEROCROSSING },
		.ram_profiles[3] = { .start = 2, .end = 2, .rate = 0, .mode = AD_RAM_PROFILE_MODE_ZEROCROSSING },
		.logic_level_sequence = lower_logic_sequence(v2->elements),
		.ram_image = { .buffer = (uint32_t*)ram, .size = 3 },
		.ram_destination = AD_RAM_DESTINATION_POLAR,
		.ram_secondary_params = { .ftw =  ftw }
	};

	sequencer_reset();
	sequencer_add(pulse);
	sequencer_run();

	free_vec(vec);
	free_vec(v2);
}

void xmitdata_ram_psk_cmd(const char* str) {
	char o_unit[4] = {0};
	char f_unit[4] = {0};
	char ts_unit[4] = {0};
	double offset;
	double freq;
	double tstep;
	int data_offset;

	int rc = sscanf(str, "%*s %*s %lf %3s %lf %3s %lf %3s %n", &offset, o_unit, &freq, f_unit, &tstep, ts_unit, &data_offset);

	if (rc != 6) {
		printf("Invalid arguments: %d\n", rc);
		printf("Usage: basic_xmitdata ram_psk offset unit freq unit tstep unit data data data ...\n");
		printf("Example: basic_xmitdata ram_psk 0 us 151.10 MHz 10 us 1 1 0 1 ...\n");
		return;
	}

	vec_t(uint8_t)* vec = scan_uint8_data(str + data_offset);
	size_t element_count = vec->size;

	uint8_t* ram = malloc(4*element_count + 4);

	for (size_t i = 0; i < element_count; i++) {
		if (vec->elements[i] == 0) {
			ram[4*i + 0] = 0x00;
			ram[4*i + 1] = 0x00;
			ram[4*i + 2] = (ad_default_asf >> 6);
			ram[4*i + 3] = (ad_default_asf << 2) & 0xFF;
		} else {
			ram[4*i + 0] = 0x7F;
			ram[4*i + 1] = 0xFF;
			ram[4*i + 2] = (ad_default_asf >> 6);
			ram[4*i + 3] = (ad_default_asf << 2) & 0xFF;
		}
	}

	memset(ram + element_count*4, 0, 4);

	uint32_t freq_hz = parse_freq(freq, f_unit);
	uint32_t offset_ns = parse_time(offset, o_unit);
	uint32_t tstep_ns = parse_time(tstep, ts_unit);
	uint32_t duration_ns = tstep_ns * element_count;
	double emit_sec = duration_ns / 1000.0 / 1000.0 / 1000.0;

	if (freq_hz == 0) {
		return;
	}

	assert(tstep_ns % 4 == 0);

	char* verif_freq = freq_unit(freq_hz);
	char* verif_offset = time_unit(offset_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_tstep = time_unit(tstep_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_duration = time_unit(duration_ns / 1000.0 / 1000.0 / 1000.0);

	printf("Basic PSK at %s, offset %s, %u * %s elements = %s total duration\n", verif_freq, verif_offset, element_count, verif_tstep, verif_duration);

	free(verif_freq);
	free(verif_offset);
	free(verif_tstep);
	free(verif_duration);

	uint32_t ftw = ad_calc_ftw(freq_hz);

	seq_entry_t pulse = {
		.t1 = timer_mu(offset_ns),
		.t2 = timer_mu(offset_ns + duration_ns),
		.fsc = ad_default_fsc,
		.ram_profiles[0] = {
			.start = element_count,
			.end = element_count,
			.rate = 0,
			.mode = AD_RAM_PROFILE_MODE_DIRECTSWITCH
		},
		.ram_profiles[1] = {
			.start = 0,
			.end = element_count,
			.rate = tstep_ns / 4,
			.mode = AD_RAM_PROFILE_MODE_RAMPUP
		},
		.ram_image = { .buffer = (uint32_t*)ram, .size = element_count + 1 },
		.ram_destination = AD_RAM_DESTINATION_POLAR,
		.ram_secondary_params = { .ftw =  ftw },
		.logic_level_sequence = lower_logic_sequence((logic_t[]){
			{ .hold = emit_sec, .state = PROFILE1 },
			{ .hold = .000001, .state = PROFILE0 },
			{ 0, 0 }
		})
	};

	sequencer_reset();
	sequencer_add(pulse);
	sequencer_run();

	free_vec(vec);
}

void basic_xmitdata_cmd(const char* str) {
	char cmd[32] = {0};

	int rc = sscanf(str, "%*s %31s", cmd);

	if (rc != 1) {
		printf("Invalid arguments\n");
		printf("Usage: basic_xmitdata mode ...\n");
		return;
	}

	if (strcmp(cmd, "fsk") == 0) return xmitdata_fsk_cmd(str);
	if (strcmp(cmd, "psk") == 0) return xmitdata_psk_cmd(str);
	if (strcmp(cmd, "zc_psk") == 0) return xmitdata_zc_psk_cmd(str);
	if (strcmp(cmd, "ram_psk") == 0) return xmitdata_ram_psk_cmd(str);

	printf("Unknown xmitdata mode: [%s]\n", cmd);
}

void sequencer_add_pulse_cmd(const char* str) {
	char o_unit[4] = {0};
	char d_unit[4] = {0};
	char f_unit[4] = {0};
	double offset;
	double duration;
	double freq;

