AXKuhta/stm32_ad9910/uart_cli.c
	int rc = sscanf(str, "%*s %*s %lf %3s %lf %3s %lf %3s", &offset, o_unit, &duration, d_unit, &freq, f_unit);

	if (rc != 6) {
		printf("Invalid arguments\n");
		printf("Usage: seq pulse delay unit duration unit freq unit\n");
		printf("Example: seq pulse 100 us 250 us 150 MHz\n");
		return;
	}

	uint32_t freq_hz 		= parse_freq(freq, f_unit);
	uint32_t offset_ns 		= parse_time(offset, o_unit);
	uint32_t duration_ns 	= parse_time(duration, d_unit);
	double emit_sec = duration_ns / 1000.0 / 1000.0 / 1000.0;

	if (freq_hz == 0) {
		return;
	}

	char* verif_freq 		= freq_unit(freq_hz);
	char* verif_offset 		= time_unit(offset_ns / 1000.0 / 1000.0 / 1000.0);
	char* verif_duration 	= time_unit(duration_ns / 1000.0 / 1000.0 / 1000.0);

	printf("Sequence basic pulse at %s, offset %s, duration %s\n", verif_freq, verif_offset, verif_duration);

	seq_entry_t pulse = {
		.t1 = timer_mu(offset_ns),
		.t2 = timer_mu(offset_ns + duration_ns),
		.fsc = ad_default_fsc,
		.profiles[0] = { .ftw = 0, .asf = 0 },
		.profiles[1] = { .ftw = ad_calc_ftw(freq_hz), .asf = ad_default_asf },
		.logic_level_sequence = lower_logic_sequence((logic_t[]){
			{ .hold = emit_sec, .state = PROFILE1 },
			{ .hold = .000001, .state = PROFILE0 },
			{ 0, 0 }
		})
	};

	sequencer_add(pulse);

	free(verif_freq);
	free(verif_offset);
	free(verif_duration);
}

void sequencer_cmd(const char* str) {
	char cmd[32] = {0};

	int rc = sscanf(str, "%*s %31s", cmd);

	if (rc != 1) {
		printf("Invalid arguments\n");
		printf("Usage: seq reset\n");
		printf("Usage: seq show\n");
		printf("Usage: seq pulse ...\n");
		printf("Usage: seq sweep ...\n");
		printf("Usage: seq run\n");
		printf("Usage: seq stop\n");
		return;
	}

	if (strcmp(cmd, "reset") == 0) return sequencer_reset();
	if (strcmp(cmd, "show") == 0) return sequencer_show();
	if (strcmp(cmd, "pulse") == 0) return sequencer_add_pulse_cmd(str);
	if (strcmp(cmd, "sweep") == 0) return sequencer_add_sweep_cmd(str);
	if (strcmp(cmd, "run") == 0) return sequencer_run();
	if (strcmp(cmd, "stop") == 0) return sequencer_stop();

	printf("Unknown sequencer command: [%s]\n", cmd);
}

void radar_emulator_cmd(const char* str) {
	char d_unit[4] = {0};
	char f_unit[4] = {0};
	double duration;
	double freq;
	int limit;

	int rc = sscanf(str, "%*s %lf %s %lf %s %d", &freq, f_unit, &duration, d_unit, &limit);

	if (rc != 4 && rc != 5) {
		printf("Invalid arguments\n");
		printf("Usage: radar_emulator freq unit duration unit [count]\n");
		printf("Example - infinite pulses: radar_emulator 25 Hz 12 us\n");
		printf("Example - just one pulse: radar_emulator 25 Hz 12 us 1\n");
		return;
	}

	if (rc == 4) {
		limit = 0;
	} else {
		if (!limit) {
			radar_emulator_stop();
			return;
		}

		if (limit > 65535) {
			printf("Pulse count must be no greater than 65535\n");
			return;
		}
	}

	if (freq == 0.0 || duration == 0.0) {
		radar_emulator_stop();
		return;
	}

	double freq_hz = parse_freq(freq, f_unit);
	double duration_ns = parse_time(duration, d_unit);

	radar_emulator_start(freq_hz, duration_ns / 1000.0 / 1000.0 / 1000.0, limit);
}

void run(const char* str) {
	char cmd[32] = {0};

	int rc = sscanf(str, "%31s", cmd);

	if (rc == 0) {
		printf("Invalid str\n");
		return;
	}

	if (strcmp(cmd, "isr") == 0) return print_it();
	if (strcmp(cmd, "seq") == 0) return sequencer_cmd(str);
	if (strcmp(cmd, "perf") == 0) return print_perf();
	if (strcmp(cmd, "write") == 0) return ad_write_all();
	if (strcmp(cmd, "verify") == 0) return ad_readback_all();
	if (strcmp(cmd, "ram_test") == 0) return ad_ram_test();
	if (strcmp(cmd, "rfkill") == 0) return enter_rfkill_mode();
	if (strcmp(cmd, "set_level") == 0) return set_level_cmd(str);
	if (strcmp(cmd, "dbg_level") == 0) return dbg_level_cmd(str);
	if (strcmp(cmd, "test_tone") == 0) return test_tone_cmd(str);
	if (strcmp(cmd, "basic_pulse") == 0) return basic_pulse_cmd(str);
	if (strcmp(cmd, "basic_sweep") == 0) return basic_sweep_cmd(str);
	if (strcmp(cmd, "basic_xmitdata") == 0) return basic_xmitdata_cmd(str);
	if (strcmp(cmd, "radar_emulator") == 0) return radar_emulator_cmd(str);

	printf("Unknown command: [%s]\n", cmd);
}
